docs/workInProgress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-05 Sat 10:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Work in Progress</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="picaud" />
<link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Work in Progress</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2ddd3a2">1. Project Journal</a>
<ul>
<li><a href="#orge339da4">1.1. <span class="timestamp-wrapper"><span class="timestamp">&lt;Sat May  5 2018&gt;</span></span> v0.2.0 is ready</a></li>
</ul>
</li>
<li><a href="#org4e3ffaa">2. Project TODO</a>
<ul>
<li><a href="#org59c2889">2.1. <span class="todo TODO">TODO</span> <code>[10/16]</code></a></li>
</ul>
</li>
<li><a href="#orgcadf148">3. Change logs</a>
<ul>
<li><a href="#orgf9034d3">3.1. v0.1.0 -&gt; v0.2.0</a></li>
</ul>
</li>
<li><a href="#orgc8a86b1">4. W3 Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2ddd3a2" class="outline-2">
<h2 id="org2ddd3a2"><span class="section-number-2">1</span> Project Journal</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge339da4" class="outline-3">
<h3 id="orge339da4"><span class="section-number-3">1.1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;Sat May  5 2018&gt;</span></span> v0.2.0 is ready</h3>
</div>
</div>
<div id="outline-container-org4e3ffaa" class="outline-2">
<h2 id="org4e3ffaa"><span class="section-number-2">2</span> Project TODO</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org59c2889" class="outline-3">
<h3 id="org59c2889"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> <code>[10/16]</code></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> add a function to show link and targets &amp; detect useless link_target</li>
<li class="off"><code>[&#xa0;]</code> search for "export" keyword to annotate documented item</li>
<li class="on"><code>[X]</code> even if complete_link = false, search for target in order to do pretty print (information like struct etc&#x2026;)</li>
<li class="on"><code>[X]</code> use extracted tag in DocumentedItem</li>
<li class="on"><code>[X]</code> allows tag list "#+tag1, tag2"</li>
<li class="on"><code>[X]</code> add prefix to extra link: <a id="org40ef245"></a> -&gt; <a id="org3d1957d"></a></li>
<li class="on"><code>[X]</code> finish parsing and code cleaning</li>
<li class="off"><code>[&#xa0;]</code> add an option to extract code body</li>
<li class="off"><code>[&#xa0;]</code> :RESULT: bug</li>
<li class="on"><code>[X]</code> fix ugly PDF link</li>
<li class="on"><code>[X]</code> detect constructor</li>
<li class="on"><code>[X]</code> for the index, lexico sort: l = L (sort not sensitive to capital)</li>
<li class="off"><code>[&#xa0;]</code> support for "@macro function() &#x2026; end"</li>
<li class="on"><code>[X]</code> support for "macro a_macro"</li>
<li class="on"><code>[X]</code> support for alias/variable "const alias = something"</li>
<li class="off"><code>[&#xa0;]</code> add procedure to generate doc without <code>ob-julia.el</code>  installed</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcadf148" class="outline-2">
<h2 id="orgcadf148"><span class="section-number-2">3</span> Change logs</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf9034d3" class="outline-3">
<h3 id="orgf9034d3"><span class="section-number-3">3.1</span> v0.1.0 -&gt; v0.2.0</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><p>
to support <a href="https://github.com/QBobWatson/poporg/blob/master/poporg.el">poporg</a> (also see <a href="https://github.com/QBobWatson/poporg">QBobWatson/poporg</a>) for comment editing, comment syntax is extended: 
</p>
<ul class="org-ul">
<li>"# +" is processed as "#+"</li>
<li>"# !" is processed as "#!"</li>
</ul>
<p>
one possible risk is than you must avoid line starting with "!"
</p>

<p>
You can install poporg from MELPA. Configuration is:
</p>
<pre class="example">
  (autoload 'poporg-dwim "poporg" nil t)
  (global-set-key (kbd "C-c \"") 'poporg-dwim)
</pre></li>
<li>add support for <code>@enum</code></li>
<li>magnified link name if link target is present</li>
<li>complete refactoring of link engine</li>
<li>add support for variables</li>
<li>add support for macros</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc8a86b1" class="outline-2">
<h2 id="orgc8a86b1"><span class="section-number-2">4</span> W3 Links</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: picaud</p>
<p class="date">Created: 2018-05-05 Sat 10:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
